using System.Collections.Generic;

namespace TestSortKeyValue {
    internal class Program {
//        Пожалуйста, разместите ссылки на код(код должен открываться в браузере, без архивов) на GitHub.
//1. Вы собираетесь совершить долгое путешествие через множество населенных пунктов.Чтобы не запутаться, вы сделали карточки вашего путешествия.Каждая карточка содержит в себе пункт отправления и пункт назначения. 
//Гарантируется, что если упорядочить эти карточки так, чтобы для каждой карточки в упорядоченном списке пункт назначения на ней совпадал с пунктом отправления в следующей карточке в списке, получится один список карточек без циклов и пропусков. 
//Например, у нас есть карточки
//Мельбурн > Кельн
//Москва > Париж
//Кельн > Москва
//Если упорядочить их в соответствии с требованиями выше, то получится следующий список: 
//Мельбурн > Кельн, Кельн > Москва, Москва > Париж
//Требуется: 
//Написать функцию, которая принимает набор неупорядоченных карточек и возвращает набор упорядоченных карточек в соответствии с требованиями выше, то есть в возвращаемом из функции списке карточек для каждой карточки пункт назначения на ней должен совпадать с пунктом отправления на следующей карточке.
//Дать оценку сложности получившегося алгоритма сортировки
//Написать тесты
//Оценивается правильность работы, производительность и читабельность кода
        private static void Main(string[] args) {

        }

        public class SortWay {
            public Dictionary<string, string> Sort(Dictionary<string,string> unsortedValues) {
                return new Dictionary<string, string>();
            }
        }
    }
}
